Revit 2027 API
Toposolid.CreateFromTopographySurface Method
 Creates a Toposolid element from a host TopographySurface, and Toposolid sub-divisions from its subregions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Toposolid CreateFromTopographySurface(
	Document document,
	ElementId hostSurfaceId,
	ElementId topoTypeId,
	ElementId levelId
)
Public Shared Function CreateFromTopographySurface (
	document As Document,
	hostSurfaceId As ElementId,
	topoTypeId As ElementId,
	levelId As ElementId
) As Toposolid
public:
static Toposolid^ CreateFromTopographySurface(
	Document^ document,
	ElementId^ hostSurfaceId,
	ElementId^ topoTypeId,
	ElementId^ levelId
)
static member CreateFromTopographySurface :
        document : Document *
        hostSurfaceId : ElementId *
        topoTypeId : ElementId *
        levelId : ElementId -> Toposolid
Parameters
document Document
 The document in which the new Toposolid is created.
hostSurfaceId ElementId
 Id of the host TopogarphySurface element.
topoTypeId ElementId
 Id of the Toposolid type to be used by the new Toposolid.
levelId ElementId
 Id of the level on which the Toposolid is to be placed.
Return Value
Toposolid
 A new Toposolid object within the project if successful.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Toposolid Class
Autodesk.Revit.DB Namespace